Revit 2026 API

# MEPConnectorInfoLinkedConnector Property

---

The linked connector or  if there is no linked connector

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Connector LinkedConnector { get; }
```
```vb
Public ReadOnly Property LinkedConnector As Connector
	Get
```
```cpp
public:
property Connector^ LinkedConnector {
	Connector^ get ();
}
```
```fsharp
member LinkedConnector : Connector with get
```

#### Property Value

Connector

#### Reference

MEPConnectorInfo Class

Autodesk.Revit.DB Namespace